
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.СхемаЗала) Тогда
		ВывестиВидСхемы(ТекущаяСтрока.СхемаЗала);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиВидСхемы(СхемаЗала)
	
	ТабличныйДокументСхемаЗала.Очистить();
	
	//получаем схему из ХранилищаЗначений, если она определена
	Схема = СхемаЗала.Схема.Получить();
	Если Схема <> Неопределено Тогда    
		//выводим полученную схему из Хранилища Значений
		ТабличныйДокументСхемаЗала.Вывести(Схема);
	КонецЕсли;	
	
КонецПроцедуры

