&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если НЕ (Элементы.Список.ТекущийРодитель = Неопределено) Тогда
		
		Если НЕ (Элементы.Список.ТекущаяСтрока = Неопределено)  Тогда

			
			Если ОтображатьКартинки Тогда
				АдресКартинки = ПолучитьНавигационнуюСсылку(Элементы.Список.ТекущаяСтрока, "Фото");
			КонецЕсли;
			
					
		КонецЕсли; 
	
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьКартинкиПриИзменении(Элемент)
	Если ОтображатьКартинки Тогда
		Элементы.Картинка.Видимость = Истина;
		
		Если НЕ (Элементы.Список.ТекущаяСтрока = Неопределено)  Тогда
			АдресКартинки = ПолучитьНавигационнуюСсылку(Элементы.Список.ТекущаяСтрока, "Фото");
		КонецЕсли;
		
	Иначе
			Элементы.Картинка.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОтфильтроватьПоКинотеатру(СсылкаНаКинотеатр)
	
	Список.Отбор.Элементы.Очистить();
	
    ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ЭлементОтбора.ПравоеЗначение = СсылкаНаКинотеатр;
    ЭлементОтбора.Использование = Истина;
КонецПроцедуры

&НаКлиенте
Процедура отбКинотеатрПриИзменении(Элемент)
	ОтфильтроватьПоКинотеатру(отбКинотеатр); 
КонецПроцедуры

&НаКлиенте
Процедура Забронировать(Команда)
	ОткрытьФорму("Документ.ЗаказПродукции.Форма.ФормаДокумента");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.отбКинотеатр = НайтиКинотеатр();
	ОтфильтроватьПоКинотеатру(ЭтаФорма.отбКинотеатр); 
	
	
КонецПроцедуры

&НаСервере
Функция НайтиКинотеатр()
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Кинотеатры.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Кинотеатры КАК Кинотеатры";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	тКино = ВыборкаДетальныеЗаписи.Наименование;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Кинотеатры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Кинотеатры КАК Кинотеатры
	|ГДЕ
	|	Кинотеатры.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", тКино);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();
		
			Возврат ВыборкаДетальныеЗаписи.Ссылка;
		
	КонецЕсли;
	
КонецФункции







