
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы <> "ФормаОбъекта" Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		// Обрабатываем стандартный параметр документа
		Основание = Параметры.Основание;
		
		Если ЗначениеЗаполнено(Основание) И ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПродукции") Тогда
			
			// Если Основание - документ заказ продукции
			// пытаемся найти уже имеющиеся подчиненные документы
			ПодчиненныйДокумент = НайтиПодчиненныйДокумент(Основание);
			
			// Если подчиненный документ есть, задаем стандартный параметр Ключ,
			// благодаря которому должна открыться форма документа по ссылке (ключу).
			Если ЗначениеЗаполнено(ПодчиненныйДокумент) Тогда
				СтандартнаяОбработка = Ложь;
				Параметры.Вставить("Ключ", ПодчиненныйДокумент);
				ВыбраннаяФорма = ПодчиненныйДокумент.Метаданные().ОсновнаяФормаОбъекта;
			КонецЕсли;
			
		КонецЕсли;
		
		
	Исключение
		//ОписаниеОшибки()
	КонецПопытки;
	 

КонецПроцедуры

Функция НайтиПодчиненныйДокумент(Основание) 

    ПодчиненныйДокумент = Документы.ПродажаПродукции.ПустаяСсылка();
    
    Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("Основание", Основание);
    Запрос.Текст = 
        "ВЫБРАТЬ
        |    ДД.Ссылка
        |ИЗ
        |    Документ.ПродажаПродукции КАК ДД
        |ГДЕ
        |    ДД.ДокументОснование = &Основание
        |    И ДД.Проведен";
        
    Результат = Запрос.Выполнить();
    Если Результат.Пустой() Тогда
        Возврат Неопределено;
    КонецЕсли;
    
    Выборка = Результат.Выбрать();
    Выборка.Следующий();
    
    Возврат Выборка.Ссылка;
	
	
КонецФункции
