
&НаКлиенте
Процедура СхемаЗалаПриИзменении(Элемент)
	
	ВывестиВидСхемы()	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВывестиВидСхемы();
	
	Элементы.ФормаКоманднаяПанель.Видимость = РольДоступна("ПолныеПрава");
	
КонецПроцедуры

&НаСервере
Процедура ВывестиВидСхемы()
	
	ТабличныйДокументСхемаЗала.Очистить();
	
	Если ЗначениеЗаполнено(Объект.СхемаЗала) Тогда
		
		//получаем схему из ХранилищаЗначений, если она определена
		Схема = Объект.СхемаЗала.Схема.Получить();
	    Если Схема <> Неопределено Тогда    
		   //выводим полученную схему из Хранилища Значений
			ТабличныйДокументСхемаЗала.Вывести(Схема);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
