Процедура ПечатьБилета(Стр, ТабДок, Сеанс) Экспорт
	
	ДанныеСеанса = Кино.ПолучитьДанныеСеанса(Сеанс);
	
	//если строка из которой будем получать данных определена,
	//то получаем области, заполняем параметры областей и выводим в табличный документ
	Если Стр <> Неопределено Тогда        		
		Макет = Документы.ПродажаБилетов.ПолучитьМакет("Билет");
		ОблКартинка = Макет.ПолучитьОбласть("Картинка");
		ОблКартинка.Параметры.Кинотеатр = ДанныеСеанса.Кинотеатр;
		ОблКартинка.Параметры.Фильм = ВРег(ДанныеСеанса.Фильм);
		ОблКартинка.Параметры.Зал = ДанныеСеанса.Кинозал;
		ОблКартинка.Параметры.Цена = Стр.Цена;
		ОблКартинка.Параметры.Ряд = Сред(Стр.Место, 1, Найти(Стр.Место, "|") - 1);
		ОблКартинка.Параметры.Место = Сред(Стр.Место, Найти(Стр.Место, "|") + 1, СтрДлина(Стр.Место) - Найти(Стр.Место, "|"));
		ОблКартинка.Параметры.Сеанс = Формат(Дата(ДанныеСеанса.ВремяСеанса), "ДФ=HH:mm");
		ОблКартинка.Параметры.День = Формат(Стр.День, "ДФ=dd.MM.yyyy");
		ТабДок.Вывести(ОблКартинка);
		
		ТабДок.ОтображатьЗаголовки = Ложь;
		ТабДок.ОтображатьСетку = Ложь;
		
	
	КонецЕсли;
	
КонецПроцедуры
