
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ЕстьБилетыВТЧ = Ложь;
	
	Если ЭтоБронирование Тогда
		ДанныеСеанса = Кино.ПолучитьДанныеСеанса(ЭтотОбъект.СеансБронирования, ЭтотОбъект.Кинотеатр, ЭтотОбъект.Фильм);
	Иначе
		ДанныеСеанса = Кино.ПолучитьДанныеСеанса(ЭтотОбъект.Сеанс, ЭтотОбъект.Кинотеатр, ЭтотОбъект.Фильм);
	КонецЕсли; 
		
	Для каждого Стр Из ЭтотОбъект.Билеты Цикл
		
		Если Не ЗначениеЗаполнено(Стр.РядМесто) Тогда
			Продолжить;	
		КонецЕсли; 
		
		МассивРядМесто = СтрРазделить(Стр.РядМесто, "|");
		
		Набор = РегистрыСведений.ПроданныеБилеты.СоздатьНаборЗаписей();
		Набор.Отбор.Время.Установить(ДанныеСеанса.ВремяСеанса);
		Набор.Отбор.День.Установить(ЭтотОбъект.ДатаСеанса);
		Набор.Отбор.Период.Установить(ЭтотОбъект.ДатаСеанса);
		Набор.Отбор.Зал.Установить(ДанныеСеанса.Кинозал);
		Набор.Отбор.Кинотеатр.Установить(ДанныеСеанса.Кинотеатр);
		Набор.Отбор.Фильм.Установить(ДанныеСеанса.Фильм);
		Набор.Отбор.Место.Установить(МассивРядМесто[1]);
		Набор.Отбор.Ряд.Установить(МассивРядМесто[0]);
		
		Попытка
			Набор.Прочитать();	
		Исключение
		    //ОписаниеОшибки()
		КонецПопытки; 
		
		
		Если Набор.Количество() Тогда
			Запись = Набор[0];
			Запись.БронированиеВыкуплено = Истина;
			Попытка
				Набор.Записать();	
			Исключение
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не удалось сделать запись по причине: " + ОписаниеОшибки();
				Сообщение.Сообщить();
				Продолжить;
			КонецПопытки;
			
			ЕстьБилетыВТЧ = Истина;
			
		Иначе	
			
			НоваяЗапись = РегистрыСведений.ПроданныеБилеты.СоздатьМенеджерЗаписи(); 
			
			НоваяЗапись.Бронирование = Ложь; 
			НоваяЗапись.Время = ДанныеСеанса.ВремяСеанса; 
			НоваяЗапись.День = ЭтотОбъект.ДатаСеанса;
			НоваяЗапись.Период = ЭтотОбъект.ДатаСеанса;
			НоваяЗапись.Зал = ДанныеСеанса.Кинозал;
			НоваяЗапись.Кинотеатр = ДанныеСеанса.Кинотеатр;
			НоваяЗапись.Место = МассивРядМесто[1];
			НоваяЗапись.Ряд = МассивРядМесто[0];
			НоваяЗапись.Фильм = ДанныеСеанса.Фильм;
			НоваяЗапись.Цена = Стр.Цена;
			НоваяЗапись.КодПодтверждения = ЭтотОбъект.УникальныйКодПродажи;
			
			Попытка
				НоваяЗапись.Записать();	
			Исключение
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не удалось сделать запись по причине: " + ОписаниеОшибки();
				Сообщение.Сообщить(); 
				Продолжить;
			КонецПопытки; 
			
			ЕстьБилетыВТЧ = Истина;
			
		КонецЕсли;
		
	КонецЦикла;		
	
	Если Не ЕстьБилетыВТЧ Тогда
		
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "В табличной части не выбрано ни одного места!";
		Сообщение.Сообщить();
		
	КонецЕсли; 
	
КонецПроцедуры
