
Функция ПолучитьДанныеСеанса(тСеанс, тКинотеатр = Неопределено, тФильм = Неопределено) Экспорт
	
	МассивСеанса = СтрРазделить(тСеанс, "|");
	СтруктураСеанса = Новый Структура;
	
	Если МассивСеанса.Количество() > 5 Тогда
		
		Кинозал = Справочники.Кинозалы.НайтиПоНаименованию(СокрЛП(МассивСеанса[2])); 
		
		Если ЗначениеЗаполнено(тКинотеатр) Тогда
			Кинотеатр = тКинотеатр;
		Иначе
			Кинотеатр = Справочники.Кинотеатры.НайтиПоНаименованию(СокрЛП(МассивСеанса[1]), Истина);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(тФильм) Тогда
			Фильм = тФильм;	
		Иначе
			Фильм = Справочники.Фильмы.НайтиПоНаименованию(СокрЛП(МассивСеанса[3]), Истина);	
		КонецЕсли;
		
		Попытка
			Стоимость = Число(МассивСеанса[0]);
		Исключение
		   	Стоимость = 0;
		КонецПопытки; 
		
		СтруктураСеанса.Вставить("Стоимость", Стоимость);
		СтруктураСеанса.Вставить("Кинотеатр", Кинотеатр);
		СтруктураСеанса.Вставить("Кинозал", Кинозал);
		СтруктураСеанса.Вставить("Фильм", Фильм);
		СтруктураСеанса.Вставить("ВремяСеанса", МассивСеанса[5]);
		СтруктураСеанса.Вставить("СформированаСтруктура", Истина);
		
	Иначе
		
		СтруктураСеанса.Вставить("СформированаСтруктура", Ложь);
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат СтруктураСеанса;
	
КонецФункции