
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Отбор.Элементы.Очистить();
	
	Бар = Параметры.ПараметрКинотеатр;
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Бар;
	ЭлементОтбора.Использование = Истина;


КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	СписокПараметров = Новый Структура;
	
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда 
		СписокПараметров.Вставить("ЭлементВыбран", Истина);
		СписокПараметров.Вставить("Товар", Элементы.Список.ТекущиеДанные.Наименование);
		СписокПараметров.Вставить("Цена", Элементы.Список.ТекущиеДанные.Стоимость);
	Иначе
		СписокПараметров.Вставить("ЭлементВыбран", Ложь);
	КонецЕсли;
	
    Закрыть(СписокПараметров);
	
КонецПроцедуры
