
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Если ОтображатьКартинки Тогда
        АдресКартинки = ПолучитьНавигационнуюСсылку(Элементы.Список.ТекущаяСтрока, "Фото");
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьКартинкиПриИзменении(Элемент)
	Если ОтображатьКартинки Тогда
        АдресКартинки = ПолучитьНавигационнуюСсылку(Элементы.Список.ТекущаяСтрока, "Фото");
        Элементы.Картинка.Видимость = Истина;
    Иначе
        Элементы.Картинка.Видимость = Ложь;
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Картинка.Видимость = Ложь;
КонецПроцедуры
