
&НаКлиенте
Процедура ПродукцияКоличествоПриИзменении(Элемент)
	РассчитатьИтого();	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьИтого()
	
	Цена = Элементы.Продукция.ТекущиеДанные.Цена;
	Количество = Элементы.Продукция.ТекущиеДанные.Количество;
	
	Элементы.Продукция.ТекущиеДанные.Итого = Цена * Количество;
	
	Объект.ИтогоКОплате = Объект.Продукция.Итог("Итого"); 

	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияТоварНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Кинотеатр) Тогда
		
		Оп = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияФормы", ЭтаФорма);
		
		П = Новый Структура("ПараметрКинотеатр", Объект.Кинотеатр);
		ОткрытьФорму("Справочник.Продукция.ФормаВыбора", П, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,Оп);
	Иначе
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбран бар!";
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияФормы(РезультатЗакрытия, ДопПараметры) Экспорт //Эта процедура будет дергаться, когда открываемая форма закроется
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("Структура") Тогда //Получаем параметры из подчиненной формы и проходим их, делаем с ними, что нам надо	
		
		Если РезультатЗакрытия.ЭлементВыбран Тогда
			Товар = РезультатЗакрытия.Товар;
			
			Если НЕ ПолучитьСсылку(Товар) = Ложь Тогда
				
				Элементы.Продукция.ТекущиеДанные.Товар = ПолучитьСсылку(Товар); 
				Элементы.Продукция.ТекущиеДанные.Цена = РезультатЗакрытия.Цена; 
				
			Иначе
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Выбрана категория продукции, а не сама продукция!";
				Сообщение.Сообщить();
				
			КонецЕсли; 	
			
		КонецЕсли;
		
	КонецЕсли;
	

КонецПроцедуры

&НаСервере
Функция ПолучитьСсылку(Товар)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Продукция.Ссылка КАК Ссылка,
	|	Продукция.ЭтоГруппа КАК ЭтоГруппа
	|ИЗ
	|	Справочник.Продукция КАК Продукция
	|ГДЕ
	|	Продукция.Владелец = &Владелец
	|	И Продукция.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Владелец", Объект.Кинотеатр);
	Запрос.УстановитьПараметр("Наименование", Товар);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Если ВыборкаДетальныеЗаписи.ЭтоГруппа = Ложь Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Возврат Ложь;
	КонецЕсли;	

КонецФункции

&НаКлиенте
Процедура ПродукцияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Элементы.ПродукцияТовар.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
КонецПроцедуры

&НаКлиенте
Процедура ЭлектроннаяПочтаПриИзменении(Элемент)
	
	Если Не ПочтовыеРассылки.ПроверитьАдресЭлектроннойПочты(Объект.ЭлектроннаяПочта) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Неверный адрес почты!" + Символы.ПС + "Сообщение не будет доставлено!";
		Сообщение.Сообщить(); 
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОнлайнОплата(Команда)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("УникальныйКодЗаказа", Объект.КодПодтверждения);
	
	ОткрытьФорму("ОбщаяФорма.ФормаОнлайнОплаты",,,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПодтверждение(Команда)
		
	Если Не ПочтовыеРассылки.ПроверитьАдресЭлектроннойПочты(Объект.ЭлектроннаяПочта) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Неверный адрес почты!" + Символы.ПС + "Сообщение не будет доставлено!";
		Сообщение.Сообщить(); 
		
		Возврат;
		
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Объект.ЭлектроннаяПочта) Тогда
		
		ПоказатьПредупреждение(, "Не заполнен почтовый адрес!", , "Подтверждение бронирования ");
		Возврат;
		
	КонецЕсли; 
	
	МассивВыбраннойПродукции = Новый Массив;
	
	Если Объект.Продукция.Количество() > 0 Тогда
		
		Для каждого Стр Из Объект.Продукция Цикл
			
			Если ЗначениеЗаполнено(Стр.Товар) Тогда
				МассивВыбраннойПродукции.Добавить(""+Стр.Товар + "|" + Стр.Количество + "|" + Стр.Итого);
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если МассивВыбраннойПродукции.Количество() = 0 Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрано ни одной продукции!";
		Сообщение.Сообщить(); 
		
		Возврат;
		
	КонецЕсли; 
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("КодБронирования", Объект.КодПодтверждения);
	СтруктураПараметров.Вставить("ПочтовыйАдресПолучателя", Объект.ЭлектроннаяПочта);
	СтруктураПараметров.Вставить("ДатаЗаказа", Объект.Дата);
	СтруктураПараметров.Вставить("Бар", Объект.Кинотеатр);
	СтруктураПараметров.Вставить("МассивВыбраннойПродукции", МассивВыбраннойПродукции);
	СтруктураПараметров.Вставить("СуммаЗаказа", Объект.ИтогоКОплате);
	
	ПочтовыеРассылки.ОтправкаПисьма(ПредопределенноеЗначение("Перечисление.ВидыОпераций.ЗаказПродукцииИзБара"), СтруктураПараметров);
	

	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.КодПодтверждения = ВспомогательныеФункции.ГенерацияСлучайногоСимвола(ТекущаяУниверсальнаяДатаВМиллисекундах());
		Элементы.ФормаОтправитьПодтверждение.Доступность = Ложь;
	Иначе
		Если РольДоступна("Клиент") Тогда
				
			Элементы.ФИОКлиента.Видимость = Ложь;
			Элементы.КонтактнаяИнформация.Видимость = Ложь;
			Элементы.КодПодтверждения.Видимость = Ложь;
			Элементы.ФормаОнлайнОплата.Видимость = Ложь;
			Элементы.ФормаОтправитьПодтверждение.Видимость = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	 Элементы.ФормаОтправитьПодтверждение.Доступность = Истина;
КонецПроцедуры







